
<?php
return [
    'main'=>[
        'app_name' => 'اهلاً بك في GDML',
        'home' => 'الصفحة الرئيسية',
        'photos' => 'الصور',
        'videos' => 'الفيديوهات',
        'draw' => 'ارسم معنا',
        'using' => 'باستخدام',
        '2d' => 'ثنائي الابعاد',
        '3d' => 'ثلاثي الابعاد',
        'about' => 'عنا',
        'share_opinion' => 'شارك رأيك معنا',
        'comment_added' => 'تم اضافة التعليق!',
        'name' => 'اسمك (اختياري)',
        'email' => 'بريدك الالكتروني (اختياري)',
        'comment' => 'اكتب تعليقك هنا...',
        'send' => 'ارسال',
        'close' => 'اغلاق',
        'unknown' => 'غير معروف',
        'err_enter_comment' => 'من فضلك ارسل تعليق قبل الارسال.',
        'delete' => 'حذف',
    ],

    'home' =>[
        'h2' => 'متعة التعلم من خلال محاكاة الرياضيات في الحياة الواقعية',
        'p1' => 'بناء الأشكال الهندسية، والمجسمات، وغيرها من الأجسام القابلة للمحاكاة والبناء بالابعاد  الثنائي والثلاثي الأبعاد.',
        'p2' => 'تحويل العمليات الرياضية والفيزيائية، والأشكال الهندسية، والأجسام المرسومة على الورق إلى تطبيقات ثنائية وثلاثية الأبعاد.',
        'p3' => 'تجميع وإعادة تجميع قطع التطبيق المختبر الهندسي البعدي المتنقل لإنتاج أشكال وتطبيقات  هندسية  متنوعة، ونماذج، وأنظمة علمية، وغيرها مما يُرسم على الورق أو من وحي خيالك.',
        'p4' => 'محاكاة الأشكال التي يمكنك بناؤها يدويًا باستخدام الحاسوب أو الأجهزة الذكية.',
        'p5' => 'استخدم أجهزتك الذكية كأداة تعليمية.',
        'objectives' => "أهداف الاختراع",
        'obj1' => 'التكامل في الرياضيات والفيزياء، وخاصة الهندسة',
        'obj2' => "البناء على خيال الطالب وترتيب الأفكار حسب الأولوية.",
        'obj3_add' => 'التدريب العملي',
        'obj3' => "تعتمد على عملية تجميع واستبدال واستبدال مكونات الاختراع، مما يعزز الابتكار والإبداع لدى الطلبة وتفاعلهم مع الأجهزة الذكية.",
        'obj4_add' => 'تعلم القياسات منذ سن مبكرة',
        'obj4' => 'من خلال تخيل وتطبيق العمليات الرياضية والفيزيائية والأشكال الهندسية والأشياء في الحياة الواقعية.',
        'obj5_add' => 'بناء الأشكال والأشياء الهندسية',
        'obj5' => 'عن طريق تجميع وإعادة تركيب قطعها، على غرار فكرة لعبة الليغو التي تعتبر لعبة ذكاء.',

    ],

    'draw' =>[
        // darw 2D page
        'try' => 'حاول معنا!',
        'cartesian' => 'تعلم وارسم شكلك الأول على المستوى الديكارتي',
        'input_type' => 'اختر نوع الإدخال:',
        'equation' => 'معادلة',
        'points' => 'نقاط',
        'write_equation_2D' => 'اكتب المعادلة (مثال: x^2 + 3*x - 5)',
        'x' => 'ادخل قيمة  x',
        'y' => 'ادخل قيمة  y',
        'draw' => 'ارسم المعادلة',
        'add' => 'اضف النقاط',
        'Enter_equation' => 'ادخل معادلة',
        'Invalid_equation' => 'معادلة غير صالحة: لا يمكن أن ينتهي التعبير بعامل (+، -، *، /)',
        'Invalid_formula' => 'صيغة غير صالحة: تسلسل غير صالح من المتغيرات (على سبيل المثال ++، --، //)',
        'err_valid_val' => 'أدخل القيم الصالحة لـ x و y.',

        // draw 3D page
        '3D' => 'تعلم وارسم أول شكل ثلاثي الأبعاد',
        'write_equation_3D' => 'اكتب المعادلة (مثال: x^2 + y^2)',
        'z' => 'أدخل قيمة  z',
        'Invalid_char' => 'أحرف غير صالحة. استخدم x، y، والأرقام، و+، -، *، /، ^، ودوال مثل pow(x، 2)، وsin(x)، وcos(y).',
        'Invalid_format' => 'تنسيق غير صالح. تجنب استخدام العمليات المتتالية (مثل ^^، ++، --) أو الأنماط غير الصالحة.',
        'pow_formula' => 'صيغة pow غير صالحة. استخدم pow(الأساس، الأس)، مثل pow(x، 2) أو pow(2، x).',
        'err_equation' => 'يجب أن تحتوي المعادلة على x أو y حتى تتمكن من الرسم ثلاثي الأبعاد.',
        'Error_processing' => 'حدث خطأ أثناء معالجة الأسس. تحقق من صحة صيغة ^، مثل x^2 أو 2^x.',
        'err_valid_vals' => 'أدخل القيم الصحيحة لـ x وy وz'
    ],

    'imgs&vids' =>[
        'add1' => 'شكل هندسي تم محاكاته على ارض الواقع',
        'add2' => 'تطبيقات من مادة الهندسة في الرياضيات والفيزياء والأنظمة العلمية لجميع المستويات',
        'err_video' => 'لا يدعم متصفحك علامة الفيديو.',

    ],

    'about_us' =>[
        'h1' => 'العمل مع رسم بياني مذهل',
        'h2' => 'نحن نحاول باستمرار التعبير عن أنفسنا وتحقيق أحلامنا.',
        'address' => 'قصتنا',
        'p1' => 'بدأت قصة هذا العمل بمشكلة واجهت مؤسس الموقع وصاحب الاختراع الذي ساهم في حل هذه المشكلة فأنشأ التطبيق على هذا الموقع وهو الأستاذ باسل الهرباوي.',
        'p2' => "طلب أحد جيران باسل منه مساعدة ابنه في مادة الرياضيات - الهندسة. وتحدث جار آخر عن نفس المشكلة التي واجهها أحد أبنائه. ومن هنا بدأت الرحلة.",
        'p3' => 'بدأ باسل بتدريس هذه المادة من الرياضيات، مستخدمًا قلمًا ودفترًا وأدوات أخرى لتوصيل فكرة المسألة الهندسية للطلاب ليحاولوا حلها. وقد لاقى هذا الأسلوب استجابةً رائعة من الطلاب (استخدام الأشياء لتوضيح الهندسة - استخدام الأشياء لتمثيل الأشكال الهندسية). أثناء تدريسه لهؤلاء الطلاب، اكتشف باسل أن لديهم مشكلة في تصور الأشكال الهندسية، وفي الخيال بشكل عام، وهو أساس الابتكار والإبداع والسعي نحو التقدم العلمي والتكنولوجي.',
        'p4' => 'ومن هنا بدأت الفكرة تتمحور حول ابتكار أدوات تقوم بتحويل الأشكال والأشياء والأنظمة العلمية وأي شيء يمكن محاكاته إلى أشكال ملموسة يمكن إنشاؤها وبنائها، مما أدى إلى إدخال المحاكاة الرياضية من خلال البرمجيات، بالإضافة إلى محاكاتها في الحياة الواقعية باستخدام هذه الأدوات التي يمكن محاكاتها على هذا الموقع.',
    ],
    
];