
<?php
return [
    'main'=>[
        'app_name' => 'اهلاً بك في GDML',
        'home' => 'الصفحة الرئيسية',
        'photos' => 'الصور',
        'videos' => 'الفيديوهات',
        'examples' => 'امثلة',
        'draw' => 'ارسم معنا',
        'using' => 'باستخدام',
        '2d' => 'ثنائي الابعاد',
        '3d' => 'ثلاثي الابعاد',
        'about' => 'من نحن',
        'share_opinion' => 'شارك رأيك معنا',
        'comment_added' => 'تم اضافة التعليق!',
        'name' => 'اسمك (اختياري)',
        'email' => 'بريدك الالكتروني (اختياري)',
        'comment' => 'اكتب تعليقك هنا...',
        'send' => 'ارسال',
        'close' => 'اغلاق',
        'unknown' => 'غير معروف',
        'err_enter_comment' => 'من فضلك ارسل تعليق قبل الارسال.',
        'delete' => 'حذف',
    ],

    'home' =>[
        'h2' => 'متعة التعلم من خلال محاكاة الرياضيات في الحياة الواقعية',
        'p1' => 'بناء الأشكال الهندسية، والمجسمات، وغيرها من الأجسام القابلة للمحاكاة والبناء بالابعاد  الثنائي والثلاثي الأبعاد.',
        'p2' => 'تحويل العمليات الرياضية والفيزيائية، والأشكال الهندسية، والأجسام المرسومة على الورق إلى تطبيقات ثنائية وثلاثية الأبعاد.',
        'p3' => 'تجميع وإعادة تجميع قطع التطبيق المختبر الهندسي البعدي المتنقل لإنتاج أشكال وتطبيقات  هندسية  متنوعة، ونماذج، وأنظمة علمية، وغيرها مما يُرسم على الورق أو من وحي خيالك.',
        'p4' => 'محاكاة الأشكال التي يمكنك بناؤها يدويًا باستخدام الحاسوب أو الأجهزة الذكية.',
        'p5' => 'استخدم أجهزتك الذكية كأداة تعليمية.',
        'objectives' => "أهداف الاختراع",
        'obj1' => 'التكامل في الرياضيات والفيزياء، وخاصة الهندسة',
        'obj2' => "البناء على خيال الطالب وترتيب الأفكار حسب الأولوية.",
        'obj3_add' => 'التدريب العملي',
        'obj3' => "تعتمد على عملية تجميع واستبدال واستبدال مكونات الاختراع، مما يعزز الابتكار والإبداع لدى الطلبة وتفاعلهم مع الأجهزة الذكية.",
        'obj4_add' => 'تعلم القياسات منذ سن مبكرة',
        'obj4' => 'من خلال تخيل وتطبيق العمليات الرياضية والفيزيائية والأشكال الهندسية والأشياء في الحياة الواقعية.',
        'obj5_add' => 'بناء الأشكال والأشياء الهندسية',
        'obj5' => 'عن طريق تجميع وإعادة تركيب قطعها، على غرار فكرة لعبة الليغو التي تعتبر لعبة ذكاء.',

    ],

    'draw' =>[
        // darw 2D page
        'try' => 'حاول معنا!',
        'cartesian' => 'تعلم وارسم شكلك الأول على المستوى الديكارتي',
        'input_type' => 'اختر نوع الإدخال:',
        'equation' => 'معادلة',
        'findY' => 'جد قيمة y من المعادلة ',
        'points' => 'نقاط',
        'write_equation_2D' => 'اكتب المعادلة (مثال: x^2 + 3*x - 5)',
        'x' => 'ادخل قيمة  x',
        'y' => 'ادخل قيمة  y',
        'draw' => 'ارسم المعادلة',
        'add' => 'اضف النقاط',
        'address_img' => 'حاول التدريب على معادلات أخرى ليظهر لك شكلها',
        'Enter_equation' => 'ادخل معادلة',
        'Invalid_equation' => 'معادلة غير صالحة: لا يمكن أن ينتهي التعبير بعامل (+، -، *، /)',
        'Invalid_formula' => 'صيغة غير صالحة: تسلسل غير صالح من المتغيرات (على سبيل المثال ++، --، //)',
        'err_valid_val' => 'أدخل القيم الصالحة لـ x و y.',

        // draw 3D page
        '3D' => 'تعلم وارسم أول شكل ثلاثي الأبعاد',
        'write_equation_3D' => 'اكتب المعادلة (مثال: x^2 + y^2)',
        'z' => 'أدخل قيمة  z',
        'findZ' => 'جد قيمة z من المعادلة ',
        'Invalid_char' => 'أحرف غير صالحة. استخدم x، y، والأرقام، و+، -، *، /، ^، ودوال مثل pow(x، 2)، وsin(x)، وcos(y).',
        'Invalid_format' => 'تنسيق غير صالح. تجنب استخدام العمليات المتتالية (مثل ^^، ++، --) أو الأنماط غير الصالحة.',
        'pow_formula' => 'صيغة pow غير صالحة. استخدم pow(الأساس، الأس)، مثل pow(x، 2) أو pow(2، x).',
        'err_equation' => 'يجب أن تحتوي المعادلة على x أو y حتى تتمكن من الرسم ثلاثي الأبعاد.',
        'Error_processing' => 'حدث خطأ أثناء معالجة الأسس. تحقق من صحة صيغة ^، مثل x^2 أو 2^x.',
        'err_valid_vals' => 'أدخل القيم الصحيحة لـ x وy وz'
    ],

    'imgs&vids' =>[
        'add1' => 'شكل هندسي تم محاكاته على ارض الواقع',
        'add2' => 'تطبيقات من مادة الهندسة في الرياضيات والفيزياء والأنظمة العلمية لجميع المستويات',
        'err_video' => 'لا يدعم متصفحك علامة الفيديو.',

    ],

    'examples' =>[
        'domain' => 'المجال',
        'range' => 'المدى',
        'try' => 'جرب بنفسك',
    ],

    'about_us' =>[
        'h1' => 'العمل مع رسم بياني مذهل',
        'h2' => 'نحن نحاول باستمرار التعبير عن أنفسنا وتحقيق أحلامنا.',
        'about' => 'نحن نصنع متعة في التعلم من خلال محاكاة الرياضيات على أرض الواقع، وذلك ببناء الأشكال والمجسمات الهندسية والأنظمة العلمية باستخدام الإحداثيات الثنائية والثلاثية، لتجسيد المفاهيم المجردة وتحويلها إلى نماذج ملموسة. بدأنا باستخدام أدوات تُشبه الألعاب، مثل طاولات التنس والبلياردو، ثم طوّرناها إلى أدوات تعليمية لتنمية المهارات، عبر تحويل العمليات الرياضية والفيزيائية والأشكال الهندسية — سواء المرسومة على الورق أو المتخيلة — إلى تطبيقات قائمة يمكن محاكاتها في الواقع باستخدام أدوات قابلة للتجميع والتركيب وإعادة البناء.

        نقوم بدمج التعليم العملي مع البرمجيات، حيث نوفر عبر هذا الموقع أدوات تفاعلية لمحاكاة مفاهيم الرياضيات والفيزياء والعلوم، ليتمكن المتعلم من رؤية النتائج بطريقة واقعية وعملية.',
        'our_vision' => 'رؤيتنا ',
        'vision' => 'نطمح لأن نكون المنصة التعليمية الأولى في الشرق الأوسط وشمال أفريقيا لتحويل الأشكال والمجسمات والأنظمة العلمية المعقدة إلى نماذج واقعية تساعد الأطفال والطلاب على التخيل والإبداع والابتكار، وتعلُّم القياسات بطريقة عملية.',
        'our_msg' => 'رسالتنا ',
        'msg' => 'محاكاة الصور والرسومات لتكون واقعًا ملموسًا.',
        'our_story' => 'قصتنا',
        'story' => 'بدأت الفكرة من موقف بسيط لكنه عميق الأثر. عندما طُلب من مؤسس الموقع وصاحب الاختراع، السيد باسل سمير الهرباوي، مساعدة أحد أبناء جيرانه في مادة الهندسة الفراغية، تبين أن هناك صعوبة كبيرة في تخيّل الأشكال الهندسية. ومع تكرار هذه المشكلة مع طلاب آخرين، وُلدت الحاجة إلى وسيلة تعليمية مبتكرة تُجسد الأفكار والمفاهيم المجردة. بدأ باسل باستخدام أدوات بسيطة مثل القلم والكراسة لمحاولة إيصال الأفكار، ولاحظ استجابة إيجابية من الطلاب. ومن هنا، تطورت الفكرة إلى تصميم أداة تعليمية تُحوّل الأشكال والمجسمات والأنظمة العلمية إلى نماذج يمكن إنشاؤها يدويًا وبرمجيًا، ليبدأ مشوار الاختراع الذي يتم تقديمه اليوم من خلال هذا الموقع.',
        'our_team' => 'فريق العمل',
        'team' => 'يعمل على إدارة هذا الموقع فريق متخصص يجمع بين الخبرة في الرياضيات والهندسة والبرمجة، ويقوده صاحب الاختراع ومؤسس الشركة السيد باسل سمير الهرباوي، إلى جانب نخبة من المبرمجين والمتخصصين في مجال تعليم الرياضيات، بهدف تطوير أدوات تعليمية تفاعلية تواكب التقدم العلمي وتسهل على الطلاب فهم المفاهيم المعقدة.',
        'our_goals' => 'أهدافنا',
        'add_goal1' => 'الهدف الاول',
        'goal1' => 'الاندماج بين مادتي الرياضيات والفيزياء، وخاصة فرع الهندسة.',
        'add_goal2' => 'الهدف الثاني',
        'goal2' => 'تعلم القياسات منذ الصغر من خلال تخيل و تطبيق العمليات الرياضية والفيزيائية والأشكال الهندسية والمجسمات على أرض الواقع.',
        'add_goal3' => 'الهدف الثالث',
        'goal3' => 'التدريب العملي الذي يعتمد على عملية تركيب وتجميع وتبديل القطع المكونة للاختراع الذي يعزز الابتكار والابداع للطلاب ومشاركة الأجهزة الذكية معها.',
        'add_goal4' => 'الهدف الرابع',
        'goal4' => 'بناء مايدور في مخيلة الطالب بالامكانيات المتوافرة.',
        'add_goal5' => 'الهدف الخامس',
        'goal5' => 'بناء الأشكال والمجسمات الهندسية بتجميع قطعها واعادة تجميعها مرة أخرى كافكرة ألعاب الليجو( LEGO) التي تعتبر لعبة ذكاء.',
        'add_goal6' => 'الهدف السادس',
        'goal6' => 'توفير إمكانية محاكاة الأشكال التي يمكن محاكاتها وانشاؤها يدوياً برمجيًا باستخدام الحاسوب والأجهزة الذكية.محاكاة الأشكال التي يمكن بناؤها باليد باستخدام الحاسوب أو الأجهزة الذكية.',
        'add_goal7' => 'الهدف السابع',
        'goal7' => 'جعل الأجهزة الحاسوبية والذكية وسيلة فعالة للتعلم والتفاعل.',
    ],
    
];